<net name="deploy_ssd" batch="1" version="2">
  <layers>
    <layer id="1" name="data" type="Input" precision="FP16">
      <output>
        <port id="1">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
    </layer>
    <layer id="2" name="ScaleShift_bn_data" type="ScaleShift" precision="FP16">
      <input>
        <port id="3">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="2">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
      <weights offset="0" size="6"/>
      <biases offset="6" size="6"/>
    </layer>
    <layer id="3" name="Convolution_conv0" type="Convolution" precision="FP16">
      <convolution_data stride-y="2" output="64" pad-y="3" kernel-x="7" group="1" kernel-y="7" stride-x="2" pad-x="3"/>
      <input>
        <port id="5">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="4">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
      <weights offset="12" size="18816"/>
      <biases offset="18828" size="128"/>
    </layer>
    <layer id="4" name="ReLU_relu0" type="ReLU" precision="FP16">
      <input>
        <port id="7">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="6">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
    </layer>
    <layer id="5" name="Pooling_pooling0" type="Pooling" precision="FP16">
      <pooling_data stride-y="2" rounding-type="ceil" pad-y="1" kernel-x="3" kernel-y="3" pool-method="max" stride-x="2" pad-x="1"/>
      <input>
        <port id="9">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="8">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="6" name="ScaleShift_stage1_unit1_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="11">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="10">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="18956" size="128"/>
      <biases offset="19084" size="128"/>
    </layer>
    <layer id="7" name="ReLU_stage1_unit1_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="13">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="12">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="8" name="Convolution_stage1_unit1_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="15">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="14">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="19212" size="8192"/>
      <biases offset="27404" size="128"/>
    </layer>
    <layer id="9" name="ReLU_stage1_unit1_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="17">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="16">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="10" name="Convolution_stage1_unit1_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="19">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="18">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="27532" size="73728"/>
      <biases offset="101260" size="128"/>
    </layer>
    <layer id="11" name="ReLU_stage1_unit1_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="21">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="20">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="12" name="Convolution_stage1_unit1_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="23">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="22">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="101388" size="32768"/>
    </layer>
    <layer id="13" name="Convolution_stage1_unit1_sc" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="25">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="24">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="134156" size="32768"/>
    </layer>
    <layer id="14" name="Eltwise__plus0" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="27">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="28">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="26">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="15" name="ScaleShift_stage1_unit2_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="30">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="29">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="166924" size="512"/>
      <biases offset="167436" size="512"/>
    </layer>
    <layer id="16" name="ReLU_stage1_unit2_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="32">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="31">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="17" name="Convolution_stage1_unit2_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="34">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="33">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="167948" size="32768"/>
      <biases offset="200716" size="128"/>
    </layer>
    <layer id="18" name="ReLU_stage1_unit2_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="36">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="35">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="19" name="Convolution_stage1_unit2_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="38">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="37">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="200844" size="73728"/>
      <biases offset="274572" size="128"/>
    </layer>
    <layer id="20" name="ReLU_stage1_unit2_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="40">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="39">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="21" name="Convolution_stage1_unit2_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="42">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="41">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="274700" size="32768"/>
    </layer>
    <layer id="22" name="Eltwise__plus1" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="44">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="45">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="43">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="23" name="ScaleShift_stage1_unit3_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="47">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="46">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="307468" size="512"/>
      <biases offset="307980" size="512"/>
    </layer>
    <layer id="24" name="ReLU_stage1_unit3_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="49">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="48">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="25" name="Convolution_stage1_unit3_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="51">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="50">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="308492" size="32768"/>
      <biases offset="341260" size="128"/>
    </layer>
    <layer id="26" name="ReLU_stage1_unit3_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="53">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="52">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="27" name="Convolution_stage1_unit3_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="64" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="55">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="54">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="341388" size="73728"/>
      <biases offset="415116" size="128"/>
    </layer>
    <layer id="28" name="ReLU_stage1_unit3_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="57">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="56">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="29" name="Convolution_stage1_unit3_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="59">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="58">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="415244" size="32768"/>
    </layer>
    <layer id="30" name="Eltwise__plus2" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="61">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="62">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="60">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="31" name="ScaleShift_stage2_unit1_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="64">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="63">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="448012" size="512"/>
      <biases offset="448524" size="512"/>
    </layer>
    <layer id="32" name="ReLU_stage2_unit1_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="66">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="65">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="33" name="Convolution_stage2_unit1_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="68">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="67">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights offset="449036" size="65536"/>
      <biases offset="514572" size="256"/>
    </layer>
    <layer id="34" name="ReLU_stage2_unit1_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="70">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="69">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer id="35" name="Convolution_stage2_unit1_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="2" output="128" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="2" pad-x="1"/>
      <input>
        <port id="72">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="71">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="514828" size="294912"/>
      <biases offset="809740" size="256"/>
    </layer>
    <layer id="36" name="ReLU_stage2_unit1_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="74">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="73">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="37" name="Convolution_stage2_unit1_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="512" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="76">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="75">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="809996" size="131072"/>
    </layer>
    <layer id="38" name="Convolution_stage2_unit1_sc" type="Convolution" precision="FP16">
      <convolution_data stride-y="2" output="512" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="2" pad-x="0"/>
      <input>
        <port id="78">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="77">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="941068" size="262144"/>
    </layer>
    <layer id="39" name="Eltwise__plus3" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="80">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="81">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="79">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="40" name="ScaleShift_stage2_unit2_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="83">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="82">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1203212" size="1024"/>
      <biases offset="1204236" size="1024"/>
    </layer>
    <layer id="41" name="ReLU_stage2_unit2_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="85">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="84">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="42" name="Convolution_stage2_unit2_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="87">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="86">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1205260" size="131072"/>
      <biases offset="1336332" size="256"/>
    </layer>
    <layer id="43" name="ReLU_stage2_unit2_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="89">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="88">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="44" name="Convolution_stage2_unit2_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="91">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="90">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1336588" size="294912"/>
      <biases offset="1631500" size="256"/>
    </layer>
    <layer id="45" name="ReLU_stage2_unit2_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="93">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="92">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="46" name="Convolution_stage2_unit2_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="512" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="95">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="94">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1631756" size="131072"/>
    </layer>
    <layer id="47" name="Eltwise__plus4" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="97">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="98">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="96">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="48" name="ScaleShift_stage2_unit3_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="100">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="99">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1762828" size="1024"/>
      <biases offset="1763852" size="1024"/>
    </layer>
    <layer id="49" name="ReLU_stage2_unit3_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="102">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="101">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="50" name="Convolution_stage2_unit3_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="104">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="103">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1764876" size="131072"/>
      <biases offset="1895948" size="256"/>
    </layer>
    <layer id="51" name="ReLU_stage2_unit3_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="106">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="105">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="52" name="Convolution_stage2_unit3_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="108">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="107">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="1896204" size="294912"/>
      <biases offset="2191116" size="256"/>
    </layer>
    <layer id="53" name="ReLU_stage2_unit3_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="110">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="109">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="54" name="Convolution_stage2_unit3_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="512" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="112">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="111">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2191372" size="131072"/>
    </layer>
    <layer id="55" name="Eltwise__plus5" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="114">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="115">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="113">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="56" name="ScaleShift_stage2_unit4_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="117">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="116">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2322444" size="1024"/>
      <biases offset="2323468" size="1024"/>
    </layer>
    <layer id="57" name="ReLU_stage2_unit4_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="119">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="118">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="58" name="Convolution_stage2_unit4_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="121">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="120">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2324492" size="131072"/>
      <biases offset="2455564" size="256"/>
    </layer>
    <layer id="59" name="ReLU_stage2_unit4_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="123">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="122">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="60" name="Convolution_stage2_unit4_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="128" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="125">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="124">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2455820" size="294912"/>
      <biases offset="2750732" size="256"/>
    </layer>
    <layer id="61" name="ReLU_stage2_unit4_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="127">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="126">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="62" name="Convolution_stage2_unit4_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="512" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="129">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="128">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2750988" size="131072"/>
    </layer>
    <layer id="63" name="Eltwise__plus6" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="131">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="132">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="130">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="64" name="ScaleShift_stage3_unit1_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="134">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="133">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2882060" size="1024"/>
      <biases offset="2883084" size="1024"/>
    </layer>
    <layer id="65" name="ReLU_stage3_unit1_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="136">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="135">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="66" name="Convolution_stage3_unit1_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="138">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="137">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights offset="2884108" size="262144"/>
      <biases offset="3146252" size="512"/>
    </layer>
    <layer id="67" name="ReLU_stage3_unit1_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="140">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="139">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer id="68" name="Convolution_stage3_unit1_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="2" output="256" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="2" pad-x="1"/>
      <input>
        <port id="142">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="141">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="3146764" size="1179648"/>
      <biases offset="4326412" size="512"/>
    </layer>
    <layer id="69" name="ReLU_stage3_unit1_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="144">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="143">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="70" name="Convolution_stage3_unit1_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="1024" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="146">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="145">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="4326924" size="524288"/>
    </layer>
    <layer id="71" name="Convolution_stage3_unit1_sc" type="Convolution" precision="FP16">
      <convolution_data stride-y="2" output="1024" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="2" pad-x="0"/>
      <input>
        <port id="148">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="147">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="4851212" size="1048576"/>
    </layer>
    <layer id="72" name="Eltwise__plus7" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="150">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="151">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="149">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="73" name="ScaleShift_stage3_unit2_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="153">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="152">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="5899788" size="2048"/>
      <biases offset="5901836" size="2048"/>
    </layer>
    <layer id="74" name="ReLU_stage3_unit2_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="155">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="154">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="75" name="Convolution_stage3_unit2_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="157">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="156">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="5903884" size="524288"/>
      <biases offset="6428172" size="512"/>
    </layer>
    <layer id="76" name="ReLU_stage3_unit2_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="159">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="158">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="77" name="Convolution_stage3_unit2_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="161">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="160">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="6428684" size="1179648"/>
      <biases offset="7608332" size="512"/>
    </layer>
    <layer id="78" name="ReLU_stage3_unit2_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="163">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="162">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="79" name="Convolution_stage3_unit2_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="1024" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="165">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="164">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="7608844" size="524288"/>
    </layer>
    <layer id="80" name="Eltwise__plus8" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="167">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="168">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="166">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="81" name="ScaleShift_stage3_unit3_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="170">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="169">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="8133132" size="2048"/>
      <biases offset="8135180" size="2048"/>
    </layer>
    <layer id="82" name="ReLU_stage3_unit3_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="172">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="171">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="83" name="Convolution_stage3_unit3_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="174">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="173">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="8137228" size="524288"/>
      <biases offset="8661516" size="512"/>
    </layer>
    <layer id="84" name="ReLU_stage3_unit3_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="176">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="175">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="85" name="Convolution_stage3_unit3_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="178">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="177">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="8662028" size="1179648"/>
      <biases offset="9841676" size="512"/>
    </layer>
    <layer id="86" name="ReLU_stage3_unit3_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="180">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="179">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="87" name="Convolution_stage3_unit3_conv3" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="1024" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="182">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="181">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="9842188" size="524288"/>
    </layer>
    <layer id="88" name="Eltwise__plus9" type="Eltwise" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="184">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="185">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="183">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="89" name="ScaleShift_stage3_unit4_bn1" type="ScaleShift" precision="FP16">
      <input>
        <port id="187">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="186">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="10366476" size="2048"/>
      <biases offset="10368524" size="2048"/>
    </layer>
    <layer id="90" name="ReLU_stage3_unit4_relu1" type="ReLU" precision="FP16">
      <input>
        <port id="189">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="188">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="91" name="Convolution_stage3_unit4_conv1" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="0" kernel-x="1" group="1" kernel-y="1" stride-x="1" pad-x="0"/>
      <input>
        <port id="191">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="190">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="10370572" size="524288"/>
      <biases offset="10894860" size="512"/>
    </layer>
    <layer id="92" name="ReLU_stage3_unit4_relu2" type="ReLU" precision="FP16">
      <input>
        <port id="193">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="192">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer id="93" name="Convolution_stage3_unit4_conv2" type="Convolution" precision="FP16">
      <convolution_data stride-y="1" output="256" pad-y="1" kernel-x="3" group="1" kernel-y="3" stride-x="1" pad-x="1"/>
      <input>
        <port id="195">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="194">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights offset="10895372" size="1179648"/>
      <biases offset="12075020" size="512"/>
    </layer>
    <layer id="94" name="ReLU_stage3_unit4_relu3" type="ReLU" precision="FP16">
      <input>
        <port id="197">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
